'''
Задание №8
Создайте пакет с всеми модулями, которые вы создали за время занятия.
Добавьте в __init__ пакета имена модулей внутри дандер __all__.
В модулях создайте дандер __all__ и укажите только те функции, которые могут верно работать за пределами модуля.
'''

__all__ = ['guess_game'] # Задание №2
__all__ = ['guess_game'] # Задание №3
__all__ = ['game_02']    # Задание №4
__all__ = ['func']       # Задание №5
__all__ = ['multy_game', 'add_dict_log', 'add_dict_log', 'print_result'] # Задание №6
__all__ = ['task_date']  # Задание №8
